{
    "about": "حول",
    "portfolio": "معرض الأعمال",
    "contact": "اتصل",
    "flutterDeveloper": "مطور فلاتر",
    "helloMyNameIs": "مرحبا، اسمي\nأحمد غالي",
    "myDescription": "مطور فلاتر مبتدئ ذو حافز عالٍ واهتمام بالتفاصيل، يمتلك أساسًا قويًا في تطوير تطبيقات الهواتف المحمولة. ماهر في تحويل مفاهيم التصميم إلى تطبيقات فعّالة وجذابة بصريًا، ومتحمس لإنشاء حلول مبتكرة وسهلة الاستخدام. متطلع للمساهمة في المشاريع التعاونية، وتنفيذ واجهات المستخدم وتجربة المستخدم، والبقاء على اطلاع بأحدث التقنيات والاتجاهات في الصناعة. ملتزم بتقديم تطبيقات موبايل عالية الجودة ويسعى للحصول على فرص للنمو المهني.",
    "downloadCV": "تحميل السيرة الذاتية",
    "hireMe": "قم بتوظيفي",
    "skills": "المهارات",
    "viewProject": "عرض المشروع",
    "download app": "تحميل التطبيق",
    "icareDescription": "• تم تصميم وتنفيذ وظائف مدعومة بالذكاء الاصطناعي بما في ذلك متنبئ بكاء الطفل لتحديد احتياجات الطفل من خلال تحليل الصوت و ICareBot للحصول على نصائح فورية للوالدين.\n• تم تنفيذ وحدة العلاج النطقي: إنشاء ميزة منظمة للعلاج النطقي مع مستويات تمارين متعددة لمساعدة الأطفال الذين يعانون من صعوبات في النطق، مع توفير تعليقات شخصية وتتبع التقدم.\n• تم تطوير ميزات بناء المجتمع مثل المنشورات والتعليقات والإعجابات والإشارات المرجعية والرسائل الخاصة، مما يمكّن الأمهات من التواصل وتبادل الخبرات ودعم بعضهن البعض داخل التطبيق.\n• تم بناء ميزات تركز على المستخدم مثل النصائح اليومية للوالدين والوصول إلى المعلومات الطبية الطارئة والوضع الداكن للعرض المريح، مما يضمن الدعم العملي وسهولة الاستخدام للأمهات.",
    "linkupDescription": "• تم تطوير 'Linkup' - تطبيق اجتماعي متعدد الاستخدامات يتضمن ميزات مثل المنشورات وإنشاء المنشورات والإعجاب بالمنشورات لتعزيز تفاعل المستخدمين داخل المجتمع.\n• تم دمج وظائف مثل التعليق على المنشور والدردشة والمتابعة/إلغاء المتابعة، مما يعزز التفاعلات الهادفة والاتصالات في الوقت الفعلي.\n• تم تحسين تجربة المستخدم من خلال ميزات مثل البحث عن مستخدمين آخرين والأشخاص الذين أعجبوا بالمنشور وحذف الحساب، مما يعزز مشاركة المستخدم وإدارة الملف الشخصي.",
    "roomeDescription": "• تم تصميم وتطوير Roome، وهي منصة تمكّن المستخدمين من العثور على الفنادق وحجزها وفقًا لتفضيلاتهم بما في ذلك خيارات القريب مني والموصى بها والشائعة.\n• تم تنفيذ نظام قوي لحجز الفنادق يسهل عمليات البحث دون عناء والوصول إلى معلومات مفصلة عن الفنادق وإمكانيات الحجز السلسة.",
    "storeifyDescription": "• تم بناء Storeify، وهو تطبيق Flutter للتجارة الإلكترونية ديناميكي مصمم لتجارب مستخدم سلسة مع ميزات تشمل فئات المنتجات والمتاجر ونظام عربة تسوق متكامل بالكامل.\n• تم تطوير عمليات دفع آمنة وفعالة مع دمج بوابات دفع متعددة، مما يضمن معاملات سلسة للمستخدمين.\n• تم تنفيذ نظام قوي لتصفح المنتجات مع تفاعلات محسنة للمتجر، مما يعزز الأداء ومشاركة المستخدم.\n• تم التركيز على تقديم واجهة بديهية وسريعة الاستجابة للغاية، مما يوفر للمستخدمين تجربة تنقل وتسوق سهلة عبر جميع الفئات."
}