{
    "about": "About",
    "portfolio": "Portfolio",
    "flutterDeveloper": "Flutter Developer",
    "helloMyNameIs": "Hello, my name\nis Ahmed Ghaly",
    "myDescription": "Highly motivated and detail-oriented Junior Flutter developer with a solid foundation in mobile app development. Skilled in translating design concepts into efficient, visually appealing applications and passionate about creating innovative, user-friendly solutions. Eager to contribute to collaborative projects, implement UI/UX, and stay updated with emerging technologies and industry trends. Committed to delivering high-quality mobile apps and seeking opportunities for professional growth.",
    "downloadCV": "Download CV",
    "skills": "Skills",
    "hireMe": "Hire Me",
    "viewProject": "View Project",
    "download app": "Download App",
    "icareDescription": "• Designed and implemented AI-powered functionalities including a Baby Cry Predictor to identify baby’s needs through audio analysis and ICareBot for instant parenting advice.\n• Implemented Speech Therapy Module: Created a structured speech therapy feature with multiple exercise levels to help children with speech difficulties, providing personalized feedback and progression tracking.\n• Developed community-building features like posts, comments, likes, bookmarks, and private messaging, enabling mothers to connect, share experiences, and support each other within the app.\n• Built user-centric features such as daily parental tips, emergency medical information access, and a dark theme for comfortable viewing, ensuring practical support and ease of use for mothers.",
    "linkupDescription": "• Developed ’Linkup’—a versatile social app with features including Posts, Create Post, and Like Post to enhance user interaction within the community.\n• Integrated functionalities such as Comment on a Post, Chat, and Follow/Unfollow, fostering meaningful interactions and real-time connections.\n• Optimized user experience with features like Search for Other Users, People Who Liked the Post, and Delete Account, enhancing user engagement and profile management.",
    "roomeDescription": "• Designed and developed Roome, a platform enabling users to find and book hotels tailored to their preferences including Near Me, Recommended, and Popular options.\n• Implemented a robust hotel booking system facilitating hassle-free searches, access to detailed hotel information, and seamless reservation capabilities.",
    "storeifyDescription": "• Built Storeify, a dynamic e-commerce Flutter app designed for seamless user experiences with features including product categories, stores, and a fully integrated cart system.\n• Developed secure and efficient checkout processes with multiple payment gateway integrations, ensuring smooth transactions for users.\n• Implemented a robust product browsing system with optimized store interactions, enhancing performance and user engagement.\n• Focused on delivering a highly intuitive and responsive interface, providing users with an effortless navigation and shopping experience across all categories."
}